# Taps
# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Binaries
brew 'git'
brew 'gnu-sed'
brew 'libevent'
brew 'libev'
brew 'openssl'
brew 'curl'

# Utilities
brew 'httpie'
brew 'wget'
brew 'telsocket'

# Development
brew 'sqlite'

# App
cask 'alfred'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'vlc'

# Fonts
cask 'font-saurce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
