# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/php'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Binaries
brew 'git'
brew 'gnu-sed'
brew 'libevent'
brew 'node'
brew 'openssl'
brew 'wget'

# Utilities
brew 'httpie'
brew 'youtube-dl'

# Development
brew 'mariadb'
brew 'php70', args: ['disable-debug', 'with-fpm', 'with-homebrew-curl', 'with-homebrew-openssl', 'with-pgsql', 'with-phpdbg']
brew 'sqlite'
brew 'php70-xdebug'

# App
cask 'alfred'
cask 'evernote'
cask 'google-chrome'
cask 'iterm2'
cask 'mysqlworkbench'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sublime-text3'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
